lessons = '''амма
Урок 1
20 июля, 20:00 +03:00
Вебинар. Введение в курс
Урок 2
20 июля, 22:01 +03:00
Видеоурок. Вычисления с помощью Numpy. Работа с данными в Pandas
Урок 3
27 июля, 20:00 +03:00
Вебинар. Вычисления с помощью Numpy. Работа с данными в Pandas
Урок 4
27 июля, 22:01 +03:00
Видеоурок. Визуализация данных в Matplotlib.
Урок 5
3 авг., 20:00 +03:00
Вебинар. Визуализация данных в Matplotlib
Урок 6
3 авг., 22:01 +03:00
Видеоурок. Обучение с учителем в Scikit-learn
Урок 7
10 авг., 20:00 +03:00
Вебинар. Обучение с учителем в Scikit-learn
Урок 8
10 авг., 22:01 +03:00
Видеоурок. Обучение без учителя в Scikit-learn.
Урок 9
17 авг., 20:00 +03:00
Вебинар. Обучение без учителя в Scikit-learn и введение в итоговый проект
Урок 10
24 авг., 20:00 +03:00
Вебинар. Консультация по итоговому проекту
'''

dates_dict = {'янв.': '01', 'фев.': '02', 'мар.': '03', 'апр.': '04', 'мая': '05', 'июня': '06', 'июля': '07',
              'авг.': '08', 'сент.': '09', 'окт.': '10', 'нояб.': '11', 'дек.': '12'}
new_text = ''
for lesson in lessons.split('Урок'):
    line_lesson = lesson.split('\n')
    try:
        number_lesson = int(line_lesson[0])
    except ValueError:
        print(123)
        continue
    date = line_lesson[1].split()

    new_text += f'Урок {number_lesson}. {date[0]}/{dates_dict[date[1][:-1]]} {date[2]} {line_lesson[2]}\n'

print(new_text)
